  {
      "name" : "Personalized Online Learning",
      "number" : "05-432",
      "units" : 12,
      "description" : "Cognitive Modeling and Intelligent Tutoring Systems 05-432 / 05-832 This course is offered as a 9-credit version and a 12-credit version. The 9-credit version of the course does not involve programming, the 12-credit version involves rule-based programming, as detailed below. This course addresses the use of cognitive psychology and cognitive task analysis to create computer-based intelligent tutoring systems. Students will learn data-driven and theoretical methods for creating cognitive models of human problem solving. Such models have been used to create educational software that has been demonstrated to dramatically enhance student learning in domains like mathematics and computer programming. This type of software, which originated at CMU and is now widely used in US high schools and middle schools, is probably the premier application of cognitive science in education. In addition to discussion and readings on methods and models of problem solving, learning, and tutor design, the course will have a substantial &#8220;learning by doing&#8221; component. Students will be analyzing data, designing cognitive models and interfaces, and implementing an intelligent tutoring system. Students will use CTAT (the Cognitive Tutor Authoring Tools, see <a href="http://ctat.pact.cs.cmu.edu">http://ctat.pact.cs.cmu.edu</a>) to construct tutors. Tutors built with CTAT for middle-school mathematics can be found on the Mathtutor web site (<a href="http://mathtutor.web.cmu.edu">http://mathtutor.web.cmu.edu</a>). The hands-on portion of the course differs between the 9-credit version or the 12-credit version. In the 9-credit version of the course, students will use the CTAT tools for non-programmers to create tutors. In this version of the course, no programming is required and no programming background is needed. In the 12-credit version of the course, students will learn to create rule-based cognitive models for more sophisticated tutors, a form of Artificial Intelligence programming. They will learn to program",
      "prereqs" : "85-411 or 85-213 or 15-211",
      "coreqs" : "None" 
    }