  {
      "name" : "Research Methods for Experimental Computer Science",
      "number" : "15-321",
      "units" : 9,
      "description" : "The success or failure of an experiment can turn on the details of how the experiment was performed &#8212; the experimental method. It is critical that the methodology be consistent with whatever research hypothesis is being pursued. The goal of this project-based course is to give students familiarity with and appreciation for the subtleties of a range of experimental techniques essential to high-quality empirical research. The course is based on a project that will illustrate important concepts of research methods. Example topics include user-study design and operation, data gathering, data diagnosis, experiment design and execution, signal detection, performance evaluation, error analysis, reporting results, etc. The project will explore the challenging open problem of keystroke dynamics, a biometric regime which seeks to identify/authenticate/discriminate users on the basis of their typing styles. In this context, numerous methodological issues provide the stimulus for learning how to perform empirical research from the beginning to the end of a project. Lectures will present necessary background material about the problem area and experimental methods; homework assignments and a team project will give students guided, hands-on, research and practical experience. At the end of the course, students will be acquainted with the basic issues in experimental methods, and will be able to perform independent work using the lessons learned and resources provided. Enrollment is limited to graduate students, juniors, and seniors. It will be helpful for students to have some experience with scripting languages (e.g., Perl, Python, Tcl, etc), statistically-oriented packages (e.g., R, Matlab, Weka) or other implementations of various machine-learning-type classifiers. This course can be used to satisfy the Lab requirement for the Computer Science major.",
      "prereqs" : "15-213",
      "coreqs" : "None" 
    }