  {
      "name" : "Introduction to Professional and Technical Writing",
      "number" : "76-271",
      "units" : 9,
      "description" : "Documents that are labeled professional and technical are woven into the activities they support. People do things with these documents: choose health plans, refinish furniture, construct websites, identify flowers, operate nuclear reactors, donate to political campaigns, learn chemistry, hire employees, etc. They read and use these documents on the phone, in a cab, in the back yard, in business class before the flight leaves the runway, in the desert. They use them in leisurely comfort, in well-worn desk chairs, and under severe time constraints on the factory floor. : The primary challenge of a professional writing task is to create a document that someone can read and use easily. That is why courses like this fall under the purview of rhetoric: rhetoric is a discipline that has long been concerned with the crafting of discourse that translates into action. Not incidentally, it foregrounds audiences and situations in the crafting of such discourses. In order to create documents that work, writers must know as much as possible about the audience, the purpose of the document, and the social and physical environment in which it will be read and used. In this class, you will develop an approach to writing professional documents; you will learn to construct knowledge about and analyze an audience, a purpose, and a context, to transform that analysis into a plan for creating a document that does what you want it to do, and to execute, evaluate and revise that document. : What about genres? Recurrent situations lead to recurrent document features&#8212;consider this syllabus, for instance. Carolyn Miller (1984) proposed in a landmark article that &#8220;genres are typified rhetorical actions based in recurrent situations,&#8221; and that a genre&#8217;s formal features arise out of the features of the situation it is linked to. Please see English Dept. for full course description.",
      "prereqs" : ["76-101"],
      "coreqs" : [] 
    }