  {
      "name" : "Topics in Rhetoric",
      "number" : "76-325",
      "units" : 9,
      "description" : "Topics will vary by semester. Fall 2012: What do we mean when we say that someone has 'twisted' our words, or that our words have been 'taken out of context?' Why is Martin Luther King Jr. best remembered for saying, 'I have a dream,' and not for saying, 'War is the greatest plague that can affect humanity?' What are political 'talking points' and how are they perpetuated? How does a claim (unfounded or not) become a fact? How does a fact become a myth? These are just some of the questions that we will consider. More specifically, this is a course in how meaning changes as texts created in one context and for specific purposes are repeated, cited, and used in other contexts and for other purposes, sometimes related and relevant, sometimes not. More technically, we'll be focusing on the rhetorical nature of intertextual discourse. Our goal will be to examine the ways that people of all kinds&#8212;including politicians, journalists, and scientists&#8212;strategically draw upon and transform the statements, arguments, and evidence of other people to promote their own viewpoints or purposes. We will begin by investigating scholarship that views language as an extended conversation in which people struggle to have their own voices heard, and other voices countered or even suppressed. Later, we will survey a number of studies that suggest how individuals and organizations recontextualize and reinterpret prior discourse for persuasive ends. More specifically, we will analyze how the micro-features of the language (for example, qualifications, evaluations, and attributions) are used to persuade audiences that certain assertions are (not) factual, that certain speakers are (not) authoritative, and that certain proposed actions are (un)desirable. Ultimately, you will conduct your own research on intertextual rhetoric on a topic of specific interest to your",
      "prereqs" : "76-101",
      "coreqs" : "None" 
    }