  {
      "name" : "Planning and Testing Documents",
      "number" : "76-359",
      "units" : 9,
      "description" : "We often send the documents we produce out into the world, having worked hard on them and hoping that they achieve the purposes that we intend for them. In some situations, this suffices. In others, however, we may need more than hard work and hope&#8212;we may need to know that a document is working: Are thousands or even millions of people going to be using the document? Can they comprehend it? Can they follow its directions safely? Are they fearful or confident as they do so? In Planning and Testing Documents, you will study and practice methods for providing valid and reliable answers to these types of questions, both in the lab&#8212;before a document goes out the door&#8212;and in the field&#8212;after a document is in the world. Learning about the problems readers have using documents can be a rewarding experience for professional writers. And the reasons for doing so are several: Various studies have shown that reader feedback helps professional writers optimize the effectiveness of their documents, that professional writers themselves are unable to predict the problems readers experience, and that writers become more aware of their audiences and improve as writers when they are regularly confronted with reader feedback. Topics will include both basic issues that pertain to all empirical research methods&#8212;sampling, response rates, validity and reliability, the design of questionnaires, scales and surveys, the ethical issues involved in doing research with people&#8212;as well as methods specifically relevant to planning and testing documents, such as subject matter expert (SME) observation and interviews, think-aloud usability testing (you&#8217;ll learn more than the &#8220;crash course&#8221; basics that you learned in your introductory professional writing course), plus-minus testing method, designing comprehension tests, and other reader-focused evaluation methods. (See Dept. for full description)",
      "prereqs" : "76-390 or 76-272 or 76-271 or 76-270",
      "coreqs" : "None" 
    }