  {
      "name" : "Special Topics in Literary and Cultural Studies",
      "number" : "76-327",
      "units" : 9,
      "description" : "Topics will vary by semester. Fall 2012: This course surveys twentieth-century poetry of the Americas. As such, it brings together poets who are usually studied independently of each other due to boundaries of nation and language. Sharing a 500-year history of forced migration and territorial conquest, the Americas, as a space for comparative poetics, enables alternative trajectories of modernity to emerge. Some of the questions we will consider include: What happens when we shift from a transatlantic focus on Anglo-American modernism to a hemispheric focus on the poetry of the Americas? What new concerns of major American modernist poets&#8212;such as T.S. Eliot, Hilda Doolittle, and William Carlos Williams&#8212;surface when we read them alongside their Latin American contemporaries&#8212;such as Ruben Dario, Delmira Augustina, and Xul Solar&#8212;instead of their usual British counterparts? What role does poetry of the African diaspora play in a hemispheric poetics? Does a shared politics of form come into relief, for example, when we pair the Harlem Renaissance blues lyrics of Langston Hughes with the Afro-Cuban verse of his contemporary Nicolas Guillen? What new discoveries might we make reading English-language feminist poets Adrienne Rich and Audre Lorde next to their Spanish-language peers Soledad Farina and Daisy Zamora (both of whom were forced into exile by state violence)? Throughout the course, we will be interested in asking what new possibilities arise (as well as what limits) when we read poetry across linguistic and national lines. Our goal is to locate overlooked correspondences, as well as to identify problems of translation (broadly conceived to include not only issues to language, but historical and social impasse as well). (See Department for full description.)",
      "prereqs" : ["76-101"],
      "coreqs" : [] 
    }