  {
      "name" : "Process of Reading and Writing",
      "number" : "76-420",
      "units" : 9,
      "description" : "This course is an introduction to the thinking, meaning-making process that underlies reading and writing. It asks: what are the social and cognitive processes, what are the conscious and unconscious problem-solving strategies we use: to comprehend and interpret text, to construct and communicate our own meanings, and to project or discover our readers' responses? In the first half of the course we look at writers and designers as thinkers and problem solvers&#8212;facing the challenge of equally creative, meaning-making readers and their own constructive, interpretive processes of comprehension. Understanding (and user-testing for) how readers actually interpret texts is critical to many kinds of writing, from informative websites and PR work, to persuasive applications and powerful arguments. An introduction to the research and theory on reading and writing as a social/cognitive process lets us explore the why behind the what readers do. For instance, you will learn how memory networks, cognitive schemas, and meta-knowledge can shape and are shaped by language and discourse as socially constructed mediating tools. At the same time you will develop a portfolio of methods that track the constructive, inferential process of readers' comprehension. In the second half of the course we turn to you and your own writing as a thinking process engaged in the constant effort to juggle competing goals. You will gain insight into your current problem-solving strategies and develop new ones for doing reader-based writing and design. The final project (which studies your own process on a current writing task) will expand your portfolio of methods into a toolkit of expert strategies for 1) both composing and communication and for 2) user testing and inquiry into the comprehension of real readers that uncovers how others actually interpret what you thought you said.",
      "prereqs" : ["76-101"],
      "coreqs" : [] 
    }