  {
      "name" : "Creative Nonfiction Workshop",
      "number" : "76-464",
      "units" : 9,
      "description" : "This is an advanced writing course that has been specifically designed for the student who wishes to polish and practice the skills of prose writing while pursuing the intellectual challenge of this particular form, the personal essay. Professional writing majors were particularly considered as &#8220;clients&#8221; for this course. The form of the personal essay did not exist until Michel Montaigne &#8220;accidentally&#8221; invented it in the 16th Century. His speculative musings, observations of nature and, especially, himself came together to make a unique genre which engages any topic while the actual subject of the essay is the essayist&#8217;s mind, his or her thinking the subject through. To try to explore one&#8217;s mind on a particular question has become a favorite activity of writers ever since &#8211; all the way down to Emma Bombeck and Russell Baker. Essays by Montaigne will be read to see how he puts his thoughts together; was it a casual endeavor or a self-conscious craft? For us, the second method. Then, we will turn to more contemporary practitioners to study and enjoy their variations on the model. Meanwhile, students will put their writing skills to the test of this seemingly informal and arbitrary form. Some students will, at first, find it difficult not to make a point, not &#8220;to stick to the subject&#8221; the object here is to engage the full range of the mind&#8217;s capacity for speculation and observation, recall and realignment of opinions and information. And, the results of this self-inquiry expressed in disciplined, lively prose. Student essays will be work shopped in class. All papers are to be distributed to class members for a review via e-mail prior to their discussion in class. Schedules and deadlines are to be worked out between instructor and student. Please see English Dept. for full course description.",
      "prereqs" : "76-260 or 76-262 or 76-365 or 76-460 or 76-265",
      "coreqs" : "None" 
    }