  {
      "name" : "Visual/Verbal Communication",
      "number" : "76-428",
      "units" : 9,
      "description" : "People create a wide range of communicative artifacts that integrates visual and verbal elements&#8212;newsletters, product brochures, web pages, graphical novels, journal articles, resumes, software references, yellow stickies, etc. Yet, such visual-verbal discourse has only recently attracted the serious attention of research communities. Some of the relevant research questions include: Why do visual variations exist across different contexts? (e.g., Popular science looks different from Discover.) Why and how do visual styles change over time? (e.g., Magazines from the 1950s don&#8217;t look like present day magazines.) Do visual elements have persuasive power? If so, what roles do they play in shaping an argument? How do people learn to communicate using visual-verbal artifacts? : In this seminar, we will address these and other questions through readings and discussions on various threads of studies around the analysis of communicative artifacts that integrate visual and verbal expressions. We will review key research publications concerning visual-verbal communication from relevant disciplines, including professional &amp; technical communication, rhetoric, argumentation, and literacy. Particular attention will be paid to descriptive methods (e.g., social-semiotic analysis, visual argument, and rhetorical structure theory) and the types of questions these methods can help us answer. Throughout the semester, students will be encouraged to explore the visual-verbal communication artifacts found around them and use those to connect class discussions to the practice of design. Required assignments include a brief bi-weekly response to the readings, several short analysis papers, and a longer term paper with a topic chosen by students based on their professional or research interests. Please see English Dept. for full course description.",
      "prereqs" : "76-101",
      "coreqs" : "None" 
    }