  {
      "name" : "Studies in Print Culture",
      "number" : "76-444",
      "units" : 9,
      "description" : "Topics vary by semester. Fall 2012: The first modern media age emerged in the eighteenth-century, with new forms of print, orality, and their impact on a growing public. We will consider early modern and Enlightenment practices of communication, media, and the book, then explore their Romantic and Victorian transformations in the nineteenth century. Reading histories of the book, novels, and early journalism &#8211; along with a good deal of current book-history and media scholarship &#8211; we will aim to understand the relation between print as a set of material forms, on the one hand, and wider cultural processes at work in the eighteenth and nineteenth centuries. These included the power of the early modern Republic of Letters and its disintegration by 1800, then the ensuing reconfiguration of its knowledges in the nineteenth-century cultural fields and disciplines. We will also look at the forming and division of new reading publics and their ways of reading print; important changes in book production, typography, printing methods (hand-press to steam press), and bookselling. We will study the relation between the aesthetic powers of the 'text' and the sociocultural impact of the 'book.' We will also use some tools in 'digital humanities' to help study book history. Books and other print formats were 'new media' in their time, and we will try to see them as emerging in cultural history. You will have hands-on experience with earlier books, periodicals, and other forms of print as we meet several times in the Rare Book Room at Hunt Library and the printshop. Each student will be asked to make a class presentation on a rare text as published in the period 1450-1800. Two papers will be required &#8211; one shorter paper and a longer research paper on an issue of understanding the uses of print and critical theories in book history before the twentieth century.",
      "prereqs" : ["76-101"],
      "coreqs" : [] 
    }