  {
      "name" : "Argument Theory",
      "number" : "76-486",
      "units" : 9,
      "description" : "The difficult part in an argument is not to defend one's opinion, but rather to know it.' &#8212; Andre Maurois This seminar will be an in-depth exploration of theories of argument and assumes some prior knowledge or coursework in argumentation such as acquired in 76-373/773. As the above quote from Maurois suggests, we will take a broad view of the concept of 'argument' and examine its role as a discursive means of truth seeking, knowledge creation, and decision-making, not just as the practice of using language to justify or refute a conclusion. The goal of the seminar is for participants to acquire the concepts needed to read the current research/scholarship on argumentation with understanding, to apply that research to the analysis of arguments, and to be positioned to contribute to that research. We will begin with a brief history of the classical Greek writings on logic, rhetoric and dialectic, especially the writings of Aristotle. There are questions from that tradition that endure to this day: What does it take for a conclusion to be well supported? What criteria should be govern acceptance of a conclusion? We will also examine two landmarks in the contemporary study of argumentation, Perelman and Olbrects-Tyteca's The New Rhetoric and Toulmin's The Uses of Arguments, both published in 1958. These works can be seen as taking the first steps toward studying argumentation functionally, as a linguistic activity that occurs in contexts. We will also look at theories of acquisition of argumentation skill and implications for pedagogical practice. We will then move to current questions in argument theory such as the relation between formal and informal logic, argument quality and cultural difference, and so forth. Along the way we will ask questions such as, 'What should a theory of argumentation do?' (See Department for full description.)",
      "prereqs" : "76-101",
      "coreqs" : "None" 
    }