  {
      "name" : "Meaning in Language",
      "number" : "80-381",
      "units" : 9,
      "description" : "This course is an introduction to the study of meaning from a linguistic perspective. Linguists studying meaning need to be able to say what the meanings of sentences are, and to explain how those meanings are constructed from the meanings of sentence parts: words, morphemes and syntactic structure. In this course, we'll focus on developing a vocabulary for talking about the truth conditional content of sentences: the part of meaning that has to do with representing the world as being a particular way. We'll also investigate how particular words and constructions affect the appropriateness conditions of sentences in which they occur, that is, the conditions under which those sentences can be appropriately used in discourse. As we'll see, many linguistic items affect sentence meaning in both of these ways simultaneously. The semantic contributions of a wide range of linguistic forms will be covered in the course. By the end of the semester, you will be able to state clearly what the difference is between the noun phrases 'a dog' and &#8220;the dog&#8221;; you'll understand the difference between the sentence 'All dogs have tails' and the sentence 'Dogs have tails'; and you&#8217;ll know why the sentence 'John left yesterday' sounds fine but the sentence 'John has left yesterday' doesn't. You&#8217;ll know how to talk about the meanings of sentences with modals, like 'John might have left', and you'll understand what the difference is between saying 'JOHN didn't see Bill' and saying 'John didn't see BILL'. All this, and more. While the course will develop precise ways of talking about meaning, it will not be particularly technical. (The amount of technical material to be introduced will be determined on the basis of the skills and interests of students.) Material in the course will presuppose a basic knowledge of linguistic notions, as covered in 80-180 Nature of Language.",
      "prereqs" : "80-180",
      "coreqs" : "None" 
    }