  {
      "name" : "Introduction to Hispanic Literary and Cultural Studies",
      "number" : "82-345",
      "units" : 9,
      "description" : "FALL 2013 Hispanic Literary and Cultural Studies: The Case of the Hispanic Detective The development of a specific and idiosyncratic detective genre in Spain and Latin America is considered one of the most important cultural phenomena in the Hispanic World since the second half of the 20th century. This course is a thematic introduction to the cultural production of the transatlantic, Hispanic world (Spain and the Americas) through the lens of the Hispanic detective genre as presented in texts, film, music, and other arts. We will be using detective texts as a tool to increase linguistic and cultural proficiency, while also pairing them up with a selection of theoretical readings in order to gain knowledge about the development of the genre, often comparing it to the Anglo- and Francophone models. More importantly, we will use these texts as a means to inquire about the crucial roles played by language and discourse, politics, religion, and economic factors in the constant shaping and reshaping of the histories and cultures of the Hispanic world; likewise, these texts will be used to explore relevant and current issues such as socioeconomic, racial, and gender inequalities, immigration and exile, etc. Materials will include classic literary texts by Borges, Ocampo, Taibo II, Piglia, and V&#225;zquez Montalb&#225;n, among others, alongside notable and more recent examples of the genre in various formats. Assignments will include reading, researching, writing, presenting orally individually and in groups, as well as 2 quizzes, a midterm exam and a final project. This course will prepare specialists and non-specialists in Spanish for advanced study at the 400-level and beyond. Prerequisite: Completion of two out of three 300-level Hispanic Studies courses (82-342, 82-343, or 82-344 )or permission of the instructor.",
      "prereqs" : "Completion of two out of three 300-level Hispanic Studies courses (82-342, 82-343, or 82-344 )or permission of the instructor",
      "coreqs" : "None" 
    }