  {
      "name" : "German Classical Literature",
      "number" : "82-420",
      "units" : 9,
      "description" : "This course, conducted entirely in German, provides a basic introduction to the literature of Enlightenment, Sturm und Drang, and classicism in Germany during the second half of the eighteenth century and at the beginning of the nineteenth century. Classical literature appeared in Germany at a later date than in the other major European countries; for this reason German classical literature tends to be more accessible linguistically to contemporary readers than some other classical literatures. The course will begin with the remarkably lucid and relevant work of Lessing, in particular his plays Emilia Galotti and Nathan der Weise&#8212;both programmatic statements of Enlightenment rationality and critical bourgeois consciousness. We will then move on to the brief but important Sturm und Drang period, exploring Goethe's revolutionary novel Die Leiden des jungen Werther, Schiller's radical drama Die R&#228;uber, and Lenz's disturbing play Der Hofmeister. The focus will be on Sturm und Drang as a uniquely German phenomenon, and on the reasons for its rapid development and quick demise. Our exploration of classical literature will culminate with Goethe's Faust I, one of the great masterpieces of western literature and probably the most celebrated and influential work in the German literary canon. We will also devote time to close reading and aesthetic appreciation of some of Goethe's most beautiful poems. An examination of Schiller's letters &#220;ber die &#228;sthetische Erziehung des Menschen will round out our exploration of German classicism as an idealistic aesthetic movement. Students will be asked to complete five brief writing assignments over the course of the semester, and to take midterm and final examinations. Prerequisite: Completion of 82-325 or approved equivalent.",
      "prereqs" : "Completion of 82-325 or approved equivalent",
      "coreqs" : "None" 
    }